---
kind: method
id: M:Autodesk.Revit.DB.Definition.GetGroupTypeId
source: html/2cd88498-4a49-f1aa-a06e-03a289220778.htm
---
# Autodesk.Revit.DB.Definition.GetGroupTypeId Method

Returns the identifier of the parameter definition's parameter group.

## Syntax (C#)
```csharp
public abstract ForgeTypeId GetGroupTypeId()
```